Авторское право 2026 Kirill Fomichev

Лицензировано в соответствии с Лицензией Apache, версия 2.0 («Лицензия»);
вы не можете использовать этот файл except in compliance с Лицензией.
Вы можете получить копию Лицензии по адресу

    http://www.apache.org/licenses/LICENSE-2.0

Если это не требуется законом или не предусмотрено в письменной форме,
программное обеспечение, распространяемое на условиях Лицензии,
распространяется на условиях «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ
УСЛОВИЙ, явных или подразумеваемых, включая, помимо прочего, гарантии или
условия ТОВАРНОСТИ, ОТСУТСТВИЯ НАРУШЕНИЙ ПРАВ ТРЕТЬИХ ЛИЦ или
ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ. Вы несете ответственность за
определение целесообразности использования или распространения Работы и
принимаете на себя любые риски, связанные с осуществлением прав по этой
Лицензии.

                              Лицензия Apache
                        Версия 2.0, январь 2004 г.
                     http://www.apache.org/licenses/

  УСЛОВИЯ И ПОЛОЖЕНИЯ ДЛЯ ИСПОЛЬЗОВАНИЯ, ВОСПРОИЗВОДЕНИЯ И РАСПРОСТРАНЕНИЯ

  1. Определения.

     «Лицензия» означает условия и положения для использования,
     воспроизведения и распространения, определенные в разделах 1
     через 9 данного документа.

     «Лицензиар» означает владельца авторского права или юридическое
     лицо, уполномоченное владельцем авторского права на предоставление
     Лицензии.

     «Юридическое лицо» означает объединение действующего лица и всех
     других лиц, которые контролируют, контролируются или находятся под
     общим контролем такого лица. Для целей данного определения
     «контроль» означает (i) прямую или косвенную возможность
     определять направление управления таким лицом, будь то по
     договору или иным образом, или (ii) владение пятьюдесятью
     процентами (50%) или более голосующих акций, или (iii) выгодное
     владение таким лицом.

     «Вы» (или «Ваш») означает физическое лицо или Юридическое лицо,
     осуществляющее права, предоставленные Лицензией.

     «Исходная форма» означает предпочтительную форму для внесения
     изменений, включая, помимо прочего, исходный код программного
     обеспечения, исходную документацию и файлы конфигурации.

     «Объектная форма» означает любую форму, полученную в результате
     механического преобразования или перевода Исходной формы, включая,
     помимо прочего, скомпилированный объектный код, сгенерированную
     документацию и преобразования в другие типы носителей.

     «Работа» означает произведение авторского права, будь то в
     Исходной или Объектной форме, доступное по Лицензии, как указано
     в уведомлении об авторских правах, которое включено в или
     прилагается к работе (пример приведен в Приложении ниже).

     «Производные работы» означает любую работу, будь то в Исходной или
     Объектной форме, основанную на (или производном от) Работы и для
     которой редакционные правки, аннотации, уточнения или другие
     модификации представляют собой в целом оригинальное произведение
     авторского права. Для целей данной Лицензии Производные работы не
     включают работы, которые остаются отделимыми от Работы или только
     связывают (или связывают по имени) с интерфейсами Работы и
     Производными работами от нее.

     «Вклад» означает любое произведение авторского права, включая
     исходную версию Работы и любые модификации или дополнения к этой
     Работе или Производным работам от нее, которые намеренно
     предоставляются Лицензиару для включения в Работу владельцем
     авторского права или физическим лицом или Юридическим лицом,
     уполномоченным представлять от имени владельца авторского права.
     Для целей данного определения «представлено» означает любую форму
     электронного, устного или письменного общения, отправленного
     Лицензиару или его представителям, включая, помимо прочего,
     общение в электронных почтовых списках, системах контроля исходного
     кода и системах отслеживания проблем, которые управляются или от
     имени Лицензиара в целях обсуждения и улучшения Работы, но
     исключая общение, которое отмечено или иным образом обозначено в
     письменной форме владельцем авторского права как «Не является
     вкладом».

     «Участник» означает Лицензиара и любое физическое лицо или
     Юридическое лицо, от имени которого был получен Вклад от
     Лицензиара и который впоследствии был включен в Работу.

  2. Предоставление лицензии на авторские право. При соблюдении условий
     и положений данной Лицензии каждый Участник настоящим предоставляет
     Вам бессрочную, мировую, неисключительную, безвозмездную,
     безотзывную лицензию на авторские право на воспроизведение,
     подготовку Производных работ, публичное отображение, публичное
     исполнение, сублицензирование и распространение Работы и таких
     Производных работ в Исходной или Объектной форме.

  3. Предоставление лицензии на патент. При соблюдении условий и
     положений данной Лицензии каждый Участник настоящим предоставляет
     Вам бессрочную, мировую, неисключительную, безвозмездную,
     безотзывную (за исключением положений данного раздела) патентную
     лицензию на изготовление, использование, предложение продажи,
     продажу, импорт и иное передачу Работы, при условии, что такая
     лицензия применяется только к тем патентным требованиям, лицензия
     на которые принадлежит такому Участнику и которые necessarily
     нарушаются его Вкладом(ами) только при их использовании в
     комбинации с Работой, к которой такой Вклад был представлен. Если
     Вы предъявите патентный иск к любому лицу (включая встречный иск
     или встречный иск в судебном процессе), утверждающему, что Работа
     или Вклад, включенный в Работу, представляет собой прямое или
     соучастие в нарушении патента, то любые патентные лицензии,
     предоставленные Вам по настоящей Лицензии для такой Работы,
     прекращаются с даты предъявления такого иска.

  4. Распространение. Вы можете воспроизводить и распространять копии
     Работы или Производных работ от нее на любом носителе, с или без
     модификаций, в Исходной или Объектной форме, при условии соблюдения
     следующих условий:

     (a) Вы должны предоставить любым получателям Работы или
         Производных работ от нее копию данной Лицензии; и

     (b) Вы должны обеспечить, чтобы измененные файлы содержали
         видимые уведомления о том, что Вы изменили файлы; и

     (c) Вы должны сохранить в Исходной форме любых Производных работ,
         которые Вы распространяете, все уведомления об авторских правах,
         патентах, товарных знаках и атрибуции из Исходной формы Работы,
         за исключением уведомлений, которые не относятся ни к какой части
         Производных работ; и

     (d) Если Работа включает текстовый файл «Уведомления» (NOTICE) как
         часть своего распространения, то любые Производные работы, которые
         Вы распространяете, должны включать читаемую копию уведомлений об
         атрибуции, содержащихся в таком файле «Уведомления», за
         исключением уведомлений, которые не относятся ни к какой части
         Производных работ, по крайней мере в одном из следующих мест: в
         текстовом файле «Уведомления», распространяемом как часть
         Производных работ; в Исходной форме или документации, если они
         предоставляются вместе с Производными работами; или в
         сгенерированном Производными работами отображении, если и
         когдаsoever такие уведомления третьих сторон обычно появляются.
         Содержимое файла «Уведомления» носит информативный характер и не
         изменяет Лицензию. Вы можете добавить собственные уведомления об
         атрибуции в Производные работы, которые Вы распространяете, вместе
         или в качестве дополнения к тексту «Уведомления» из Работы,
         при условии, что такие дополнительные уведомления об атрибуции
         не могут быть истолкованы как изменение Лицензии.

     Вы можете добавить собственное уведомление об авторских правах к
     Вашим модификациям и можете предоставить дополнительные или иные
     условия лицензии для использования, воспроизведения или
     распространения Ваших модификаций или любых таких Производных работ
     в целом, при условии, что Ваше использование, воспроизведение и
     распространение Работы в остальном соответствует условиям, указанным
     в данной Лицензии.

  5. Предоставление вкладов. Если Вы не указываете иное, любой Вклад,
     намеренно представленный для включения в Работу Вами Лицензиару,
     будет на условиях и положениях данной Лицензии, без каких-либо
     дополнительных условий или положений. Несмотря на вышесказанное,
     ничего в данном документе не отменяет и не изменяет условия какой-либо
     отдельной лицензионного соглашения, которое Вы можете заключить с
     Лицензиарем относительно таких Вкладов.

  6. Торговые марки. Данная Лицензия не предоставляет разрешения на
     использование коммерческих названий, товарных знаков, знаков
     обслуживания или названий продуктов Лицензиара, за исключением
     случаев, необходимых для разумного и обычного использования при
     описании происхождения Работы и воспроизведения содержимого файла
     «Уведомления».

  7. Отказ от гарантий. Если это не требуется применимым законодательством
     или не предусмотрено в письменной форме, Лицензиар предоставляет
     Работу (и каждый Участник предоставляет свои Вклады) на условиях
     «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ УСЛОВИЙ, явных или
     подразумеваемых, включая, помимо прочего, гарантии или условия
     ТОВАРНОСТИ, ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ и ОТСУТСТВИЯ
     НАРУШЕНИЙ ПРАВ. Вы несете единоличную ответственность за
     определение целесообразности использования или распространения
     Работы и принимаете на себя любые риски, связанные с осуществлением
     прав по данной Лицензии.

  8. Ограничение ответственности. Ни при каких обстоятельствах и ни при
     какой правовой теории, будь то деликт (включая небрежность),
     договор или иное, если это не требуется применимым законодательством
     (таким как умышленные и грубые небрежные действия) или не
     предусмотрено в письменной форме, ни один Участник не несет перед
     Вами ответственности за убытки, включая любые прямые, косвенные,
     особые, случайные или косвенные убытки любого характера, возникающие
     в результате данной Лицензии или из-за невозможности использования
     Работы (включая, помимо прочего, убытки из-за потери деловой
     репутации, прекращения работы, сбоя или неисправности компьютера
     или любых иных коммерческих убытков или потерь), даже если такой
     Участник был предупрежден о возможности таких убытков.

  9. Принятие гарантий или дополнительной ответственности. При
     распространении Работы или Производных работ от нее Вы можете
     предложить и взимать плату за принятие обязательств по поддержке,
     гарантии, возмещению убытков или иных обязательств и/или прав,
     соответствующих данной Лицензии. Однако, принимая такие
     обязательства, Вы действуете только от своего имени и под свою
     единоличную ответственность, а не от имени любого другого Участника,
     и только если Вы соглашаетесь возместить, защитить и обезопасить
     каждого Участника от любых обязательств, понесенных им, или претензий,
     предъявленных к нему, по причине принятия Вами любой такой гарантии
     или дополнительной ответственности.

  КОНЕЦ УСЛОВИЙ И ПОЛОЖЕНИЙ

  ПРИЛОЖЕНИЕ: Как применить Лицензию Apache к вашей работе.

     Чтобы применить Лицензию Apache к своей работе, прикрепите следующее
     стандартное уведомление, заменив поля, заключенные в скобки «[]»,
     на вашу собственную идентифицирующую информацию. (Не включайте
     скобки!) Текст должен быть заключен в соответствующий синтаксис
     комментариев для формата файла. Мы также рекомендуем, чтобы имя
     файла или класса и описание назначения были включены на той же
     «печатной странице», что и уведомление об авторских правах, для
     более удобной идентификации в сторонних архивах.

  Авторское право 2026 Kirill Fomichev

  Лицензировано в соответствии с Лицензией Apache, версия 2.0 («Лицензия»);
  вы не можете использовать этот файл except in compliance с Лицензией.
  Вы можете получить копию Лицензии по адресу

      http://www.apache.org/licenses/LICENSE-2.0

  Если это не требуется законом или не предусмотрено в письменной форме,
  программное обеспечение, распространяемое на условиях Лицензии,
  распространяется на условиях «КАК ЕСТЬ», БЕЗ КАКИХ-ЛИБО ГАРАНТИЙ ИЛИ
  УСЛОВИЙ, явных или подразумеваемых, включая, помимо прочего, гарантии или
  условия ТОВАРНОСТИ, ОТСУТСТВИЯ НАРУШЕНИЙ ПРАВ ТРЕТЬИХ ЛИЦ или
  ПРИГОДНОСТИ ДЛЯ ОПРЕДЕЛЕННОЙ ЦЕЛИ. См. Лицензию для получения
  дополнительной информации об условиях и положениях, касающихся
  разрешений и ограничений в рамках данной Лицензии.
